# Verse 1
# 　　C　　　　　　　C
# 當我在黑暗痛苦絕望中

# 　C　　　　　　　F
# 有一曙光明照在我心

# 　　　F　　　C　　F　            C
# 他是那稱為奇妙的救  主

# 　　C　　　　　　　G7
# 捨去天上榮華為我降生

# 　　C　　　　　　　C
# 他又為我被釘在十字架

# 　C　　　　　　　F
# 情願受苦洗淨我的罪

# 　　　F　　　C　　F　            C
# 我要唱奇妙主哈利路  亞

# 　　C　　　G7　　　C
# 從今後永不會再絕望


# Chorus
# 　　C　　　　　F
# 他仁慈善良的愛

# 　　F　　G　　　G7
# 領我衝破狂風巨浪

# 　　C　　　　　　C
# 主為一顆明亮的晨星

# 　　C　　　G7　　            C
# 帶給我無限的希  望


# Verse 2
# 　　C　　　　　　　C
# 救主耶穌基督被接升天

# 　C　　　　　　　F
# 祂去原為我預備地方

# 　　　F　　　C　　F　            C
# 就必再來接我到祂父  家

# 　　C　　　　　　　G7
# 永遠與主同在到千萬年

# 　　C　　　　　　　C
# 到那時再沒有痛苦悲傷

# 　C　　　　　　　F
# 只有甜美快樂的笑容

# 　　　F　　　C　　F　            C
# 眾聖徒同集在明亮聖  城

# 　　C　　　G7　　　C
# 滿心歡頌讚美主大恩